# LDevice_GetCellCount

## Description
Get the count of cells attached to a Lighting Device.

```pascal
FUNCTION LDevice_GetCellCount(handle : HANDLE): LONGINT;
```

```python
def vs.LDevice_GetCellCount(handle):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|   |

## Version
Availability: from Vectorworks 2021

## Category
* Spotlight